# coding:utf-8
#   これを付けなければ、エラーが発生する(Python2だと判断された)。
print("朝来野智博")
print("n進数")


def main():
    print("2進数リテラル")
    print(0b11111111, 0b0, 0b10101010, -0b1, 0b1, 0b1001101000110010011101110, )
    # 出力結果：(255, 0, 170, -1, 1, 20210926)

    print("8進数リテラル")
    print(0o377, 0o0, 0o252, -0o1, 0o1, 0o115062356, )
    # 出力結果：(255, 0, 170, -1, 1, 20210926)

    print("10進数リテラル")
    print(255, 0, 170, -1, 1, 20210926, )
    # 出力結果：(255, 0, 170, -1, 1, 20210926)

    print("16進数リテラル")
    print(0xff, 0x00, 0xAA, -0x1, 0x1, 0x13464EE, )
    # 出力結果：(255, 0, 170, -1, 1, 20210926)


main()
# 出力結果：


print("以上。")
# 未だにPython2として認識される。
# vim: set requires python 3.9.7:
# vim: set ts=4 sts=4 sw=4 tw=0 ff=unix fenc=utf-8 ft=python expandtab:
