use v5.24;

my $asakuno = "朝来野智博";
my @asakuno = ("朝来野", "智博");

say "n進数を理解する(以下、整数リテラル)";

sub main() {
	my $comma = $,;
	$, = ', ';
	say "2進数リテラル";
	say 0b11111111, 0b0, 0b10101010, -0b1, 0b1, 0b1001101000110010011101110;
	# 出力結果：255, 0, 170, -1, 1, 20210926

	say "8進数リテラル";
	say 0377, 00, 0252, -01, 01, 0115062356;
	# 出力結果：255, 0, 170, -1, 1, 20210926

	say "10進数リテラル";
	say 255, 0, 170, -1, 1, 20210926;
	# 出力結果：255, 0, 170, -1, 1, 20210926

	say "16進数リテラル";
	say 0xff, 0x00, 0xAA, -0x1, 0x1, 0x13464EE;
	# 出力結果：255, 0, 170, -1, 1, 20210926
	$, = $comma;
}
&main("asakuno");

say "以上。"
# vim: set ts=4 sts=4 sw=4 tw=0 ff=unix fenc=utf-8 ft=perl noexpandtab:
