# coding:utf-8
#   これを付けなければ、エラーが発生する(Python2だと判断された)。
print("朝来野智博")
print("エラトステネスのふるい")


def main():
    eratosthenes = [True] * 100
    eratosthenes[0] = False
    eratosthenes[1] = False
    notprime = 2
    hyou(eratosthenes)
    while notprime < 10:    # ルート99まで行う。
        eratosthenes, notprime = furui(eratosthenes, notprime)


def hyou(eratosthenes):
    output = ""
    for ii in range(100):
        if eratosthenes[ii] is True:
            output += "{:2d}, ".format(ii)
        else:
            output += " /, "
        if ii % 10 == 9:
            output = output[:len(output)-1]
            output += "\n"
    print(output)
    return eratosthenes


def furui(eratosthenes, notprime):
    for ii in range(notprime+notprime, 100, notprime):
        eratosthenes[ii] = False
    print(notprime, "の倍数をふるい落とした。")
    hyou(eratosthenes)
    while notprime < 100:    # 次にふるい落とす数。
        notprime = notprime + 1
        if eratosthenes[notprime] is True:
            break
    return eratosthenes, notprime


main()
# 出力結果：
#           エラトステネスのふるい
#            /,  /,  2,  3,  4,  5,  6,  7,  8,  9,
#           10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
#           20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
#           30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
#           40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
#           50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
#           60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
#           70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
#           80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
#           90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
#
#           2 の倍数をふるい落とした。
#            /,  /,  2,  3,  /,  5,  /,  7,  /,  9,
#            /, 11,  /, 13,  /, 15,  /, 17,  /, 19,
#            /, 21,  /, 23,  /, 25,  /, 27,  /, 29,
#            /, 31,  /, 33,  /, 35,  /, 37,  /, 39,
#            /, 41,  /, 43,  /, 45,  /, 47,  /, 49,
#            /, 51,  /, 53,  /, 55,  /, 57,  /, 59,
#            /, 61,  /, 63,  /, 65,  /, 67,  /, 69,
#            /, 71,  /, 73,  /, 75,  /, 77,  /, 79,
#            /, 81,  /, 83,  /, 85,  /, 87,  /, 89,
#            /, 91,  /, 93,  /, 95,  /, 97,  /, 99,
#
#           3 の倍数をふるい落とした。
#            /,  /,  2,  3,  /,  5,  /,  7,  /,  /,
#            /, 11,  /, 13,  /,  /,  /, 17,  /, 19,
#            /,  /,  /, 23,  /, 25,  /,  /,  /, 29,
#            /, 31,  /,  /,  /, 35,  /, 37,  /,  /,
#            /, 41,  /, 43,  /,  /,  /, 47,  /, 49,
#            /,  /,  /, 53,  /, 55,  /,  /,  /, 59,
#            /, 61,  /,  /,  /, 65,  /, 67,  /,  /,
#            /, 71,  /, 73,  /,  /,  /, 77,  /, 79,
#            /,  /,  /, 83,  /, 85,  /,  /,  /, 89,
#            /, 91,  /,  /,  /, 95,  /, 97,  /,  /,
#
#           5 の倍数をふるい落とした。
#            /,  /,  2,  3,  /,  5,  /,  7,  /,  /,
#            /, 11,  /, 13,  /,  /,  /, 17,  /, 19,
#            /,  /,  /, 23,  /,  /,  /,  /,  /, 29,
#            /, 31,  /,  /,  /,  /,  /, 37,  /,  /,
#            /, 41,  /, 43,  /,  /,  /, 47,  /, 49,
#            /,  /,  /, 53,  /,  /,  /,  /,  /, 59,
#            /, 61,  /,  /,  /,  /,  /, 67,  /,  /,
#            /, 71,  /, 73,  /,  /,  /, 77,  /, 79,
#            /,  /,  /, 83,  /,  /,  /,  /,  /, 89,
#            /, 91,  /,  /,  /,  /,  /, 97,  /,  /,
#
#           7 の倍数をふるい落とした。
#            /,  /,  2,  3,  /,  5,  /,  7,  /,  /,
#            /, 11,  /, 13,  /,  /,  /, 17,  /, 19,
#            /,  /,  /, 23,  /,  /,  /,  /,  /, 29,
#            /, 31,  /,  /,  /,  /,  /, 37,  /,  /,
#            /, 41,  /, 43,  /,  /,  /, 47,  /,  /,
#            /,  /,  /, 53,  /,  /,  /,  /,  /, 59,
#            /, 61,  /,  /,  /,  /,  /, 67,  /,  /,
#            /, 71,  /, 73,  /,  /,  /,  /,  /, 79,
#            /,  /,  /, 83,  /,  /,  /,  /,  /, 89,
#            /,  /,  /,  /,  /,  /,  /, 97,  /,  /,


print("以上。")
# 未だにPython2として認識される。
# vim: set requires python 3.9.7:
# vim: set ts=4 sts=4 sw=4 tw=0 ff=unix fenc=utf-8 ft=python expandtab:
